/**
	SS6Player for CPP(C++/ssbp2)

	Copyright(C) Web Technology Corp.
	All rights reserved.
*/
/* -------------------------------------------------------------------------- */
/*                                                 Includes / Compile-Options */
/* -------------------------------------------------------------------------- */
#include "ss6player_utility_random_xorshift32.h"

namespace SpriteStudio6	{
namespace Library	{
namespace Utility	{
/* -------------------------------------------------------------------------- */
/*                          [File-Scope internal] Defines (Value-Type Macros) */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/*                       [File-Scope internal] Classes / Structures / Typedef */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/*                                            [File-Scope internal] Variables */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/*              [File-Scope internal] Inline-Functions / Function-Type Macros */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/*                                  [File-Scope internal] Function Prototypes */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/*                                                                  Functions */
/*                                                                       Text */
/* -------------------------------------------------------------------------- */
namespace Text	{
/* ********************************************************* */
//! テキストがnullptrか空関数かを判定
/* --------------------------------------------------------- */
/* MEMO:
 * 
 */
// bool IsNullOrEmpty(const char* text)

/* ********************************************************* */
//! テキストが同じであるかを判定
/* --------------------------------------------------------- */
/* MEMO:
 * 
 */
bool Compare(const char* lhs, const char* rhs, size_t length)
{
	char textL;
	char textR;
	bool flagCheckLength = (0 < length);	/* ? true : false */
	for( ; ; )	{
		/* 文字を取得 */
		textL = *lhs;
		lhs++;
		textR = *rhs;
		rhs++;

		/* 終端を検知 */
		if(0x00 == textL)	{	/* Lが終端文字 */
			if(0x00 == textR)	{	/* Rも終端文字 */
				return(true);
			} else {
				return(false);
			}
		}

		if(textL != textR)	{	/* LとRは違う文字 */
			return(false);
		}

		if(true == flagCheckLength)	{	/* 長さを見る */
			length--;
			if(0 == length)	{	/* 長さが尽きた */
				return(true);
			}
		}
	}

	/* MEMO: ここにはこない。 */
	return(false);
}
}	/* Text */

/* -------------------------------------------------------------------------- */
/*                                                                  Functions */
/* -------------------------------------------------------------------------- */

}	/* Utility */
}	/* Library */
}	/* SpriteStudio6 */
